apps/saleor-app-checkout/recordings/_2166136261/api_946514567/webhooks_2823233743/adyen_2464201380/create-new-payment-if-it-was-firstly-authorized_3582475922/recording.har

{
  "log": {
    "_recordingName": "/api/webhooks/adyen/create new payment if it was firstly authorized",
    "creator": {
      "comment": "persister:fs",
      "name": "Polly.JS",
      "version": "6.0.5"
    },
    "entries": [
      {
        "_id": "b7500749c9456f80650ca4a2a104066a",
        "_order": 0,
        "cache": {},
        "request": {
          "bodySize": 813,
          "cookies": [],
          "headers": [
            {
              "name": "accept",
              "value": "application/graphql+json, application/json"
            },
            {
              "name": "content-type",
              "value": "application/json"
            }
          ],
          "headersSize": 200,
          "httpVersion": "HTTP/1.1",
          "method": "POST",
          "postData": {
            "mimeType": "application/json",
            "params": [],
            "text": "{\"query\":\"query OrderTransactions($id: ID!) {\\n  order(id: $id) {\\n    transactions {\\n      ...Transaction\\n      __typename\\n    }\\n    errors {\\n      code\\n      message\\n      __typename\\n    }\\n    __typename\\n  }\\n}\\n\\nfragment Transaction on TransactionItem {\\n  id\\n  reference\\n  voidedAmount {\\n    ...Money\\n    __typename\\n  }\\n  refundedAmount {\\n    ...Money\\n    __typename\\n  }\\n  chargedAmount {\\n    ...Money\\n    __typename\\n  }\\n  authorizedAmount {\\n    ...Money\\n    __typename\\n  }\\n  events {\\n    ...TransactionEvent\\n    __typename\\n  }\\n}\\n\\nfragment Money on Money {\\n  currency\\n  amount\\n}\\n\\nfragment TransactionEvent on TransactionEvent {\\n  name\\n  reference\\n}\\n\",\"operationName\":\"OrderTransactions\",\"variables\":{\"id\":\"T3JkZXI6MGQ4NDRiZDMtYTA5YS00NzUyLWE0ODktYzFlMzM2Y2I4ZjU4\"}}"
          },
          "queryString": [],
          "url": "https://master.staging.saleor.cloud/graphql/"
        },
        "response": {
          "bodySize": 1371,
          "content": {
            "mimeType": "application/json",
            "size": 1371,
            "text": "{\"data\":{\"order\":{\"transactions\":[{\"id\":\"VHJhbnNhY3Rpb25JdGVtOjE3Nw==\",\"reference\":\"LD65H2FVNXSKGK82\",\"voidedAmount\":{\"currency\":\"USD\",\"amount\":42.92,\"__typename\":\"Money\"},\"refundedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"chargedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"authorizedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"events\":[{\"name\":\"AUTHORISATION\",\"reference\":\"LD65H2FVNXSKGK82\",\"__typename\":\"TransactionEvent\"},{\"name\":\"REFUND\",\"reference\":\"LD65H2FVNXSKGK82\",\"__typename\":\"TransactionEvent\"},{\"name\":\"REFUND_FAILED\",\"reference\":\"LD65H2FVNXSKGK82\",\"__typename\":\"TransactionEvent\"}],\"__typename\":\"TransactionItem\"},{\"id\":\"VHJhbnNhY3Rpb25JdGVtOjE3OA==\",\"reference\":\"LD65H2FVNXSKGK82\",\"voidedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"refundedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"chargedAmount\":{\"currency\":\"USD\",\"amount\":42.92,\"__typename\":\"Money\"},\"authorizedAmount\":{\"currency\":\"USD\",\"amount\":0,\"__typename\":\"Money\"},\"events\":[{\"name\":\"CAPTURE\",\"reference\":\"LD65H2FVNXSKGK82\",\"__typename\":\"TransactionEvent\"}],\"__typename\":\"TransactionItem\"}],\"errors\":[],\"__typename\":\"Order\"}},\"extensions\":{\"cost\":{\"requestedQueryCost\":2,\"maximumAvailable\":50000}}}"
          },
          "cookies": [],
          "headers": [
            {
              "name": "connection",
              "value": "close"
            },
            {
              "name": "content-length",
              "value": "1371"
            },
            {
              "name": "content-type",
              "value": "application/json"
            },
            {
              "name": "date",
              "value": "Tue, 02 Aug 2022 15:33:35 GMT"
            },
            {
              "name": "referrer-policy",
              "value": "same-origin"
            },
            {
              "name": "server",
              "value": "CloudFront"
            },
            {
              "name": "strict-transport-security",
              "value": "max-age=31536000; includeSubDomains"
            },
            {
              "name": "vary",
              "value": "Accept-Encoding, Origin, Access-Control-Request-Headers, Access-Control-Request-Method"
            },
            {
              "name": "via",
              "value": "1.1 f741c891af45a5dc0703dc962921c000.cloudfront.net (CloudFront)"
            },
            {
              "name": "x-amz-cf-id",
              "value": "o4VSMYulXHApPzD9BIGJznJIDBHcrmKDXoS9XkFkYQZaJcHEfFbr6A=="
            },
            {
              "name": "x-amz-cf-pop",
              "value": "TXL50-P3"
            },
            {
              "name": "x-cache",
              "value": "Miss from cloudfront"
            },
            {
              "name": "x-content-type-options",
              "value": "nosniff"
            },
            {
              "name": "x-frame-options",
              "value": "DENY"
            },
            {
              "name": "x-xss-protection",
              "value": "1"
            }
          ],
          "headersSize": 594,
          "httpVersion": "HTTP/1.1",
          "redirectURL": "",
          "status": 200,
          "statusText": "OK"
        },
        "startedDateTime": "2022-08-02T15:33:34.513Z",
        "time": 733,
        "timings": {
          "blocked": -1,
          "connect": -1,
          "dns": -1,
          "receive": 0,
          "send": 0,
          "ssl": -1,
          "wait": 733
        }
      }
    ],
    "pages": [],
    "version": "1.2"
  }
}
